---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Corner
source: html/40001c63-aa1c-1ecb-a73a-e743fdd3152c.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Corner Property

The lower-left coordinate for the analytical rectangular geometry viewed from outside.

## Syntax (C#)
```csharp
public XYZ Corner { get; }
```

## Remarks
A planar polygon describing the surface geometry as described
 in gbXML. The geometry is currently measured per analytical(center-line).